"""
while 条件 1:
    条件满足时，做的事情1
    ...(省略)...

    while 条件 2:
        条件满足时，做的事情1
        ...(省略)...

        处理条件 2

    处理条件 1

步骤流程：先写外层的while，再写内层的while
"""

"""
需求：跑步 5 圈，每跑步1圈，做10个俯卧撑
"""

# 跑步 1 圈
# 跑步 2 圈
# 跑步 3 圈
# 跑步 4 圈
# 跑步 5 圈
# i = 1
# while i <= 5:
#     print(f'跑了第{i}圈--------------')
#     j = 1
#     while j <= 3:
#         print(f'做{j}个俯卧撑')
#         j += 1
#         continue
#         print('break')
#     i += 1

# print('-----------------------------------')
# m = 1
# while m <= 5:
#     print(f'跑了第{m}圈--------------')
#     n = 1
#     while n <= 10:
#         print(f'做{n}个俯卧撑')
#         n += 1
#         break
#         print('break')
#     m += 1

"""
需求：跑步 5 圈，每跑步1圈，做10个俯卧撑
"""
i = 1
while i <= 5:
    print(f"跑步第{i}圈")
    t = 1
    while t <= 10:
        print(f"做第{t}个俯卧撑")
        t += 1
    i += 1
    print("===================================")














